Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotDuplicate Property
 Elements can't be duplicated
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDuplicate { get; }
Public Shared ReadOnly Property CannotDuplicate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDuplicate {
	FailureDefinitionId^ get ();
}
static member CannotDuplicate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace